<?php

use Illuminate\Database\Migrations\Migration;
use Illuminate\Database\Schema\Blueprint;
use Illuminate\Support\Facades\Schema;

return new class extends Migration
{
    /**
     * Run the migrations.
     *
     * @return void
     */
    public function up()
    {
        Schema::create('design_items', function (Blueprint $table) {
            $table->id();
            $table->string('name')->unique();
            $table->string('type');
            $table->json('apply_on');
            $table->boolean('status');
            $table->string('image')->nullable();
        });
    }

    /**
     * Reverse the migrations.
     *
     * @return void
     */
    public function down()
    {
        Schema::dropIfExists('design_items');
    }
};

// INSERT INTO `design_items` (`id`, `name`, `type`, `apply_on`, `status`, `image`) VALUES
// (1, 'শেরওয়ানী রাউন্ড কলার ক্যাটালগ', 'collar', '{\"একছাটা\":1}', '0', NULL),
// (2, 'শেরওয়ানী কলার', 'collar', '{\"একছাটা\":1}', '1', NULL),
// (3, 'শেরওয়ানী কলার ক্যাটালগ', 'collar', '{\"একছাটা\":1}', '0', NULL),
// (4, 'শেরওয়ানী রাউন্ড কলার', 'collar', '{\"একছাটা\":1}', '1', NULL),
// (5, 'বেল্ড কলার', 'collar', '{\"একছাটা\":1}', '1', NULL),
// (6, 'রাউন্ড বেল্ড গলা', 'collar', '{\"একছাটা\":1}', '1', NULL),
// (7, 'শার্ট কলার', 'collar', '{\"একছাটা\":1}', '1', NULL),
// (8, 'কলারে হালকা সেইভ হবে', 'collar', '{\"একছাটা\":1}', '0', NULL),
// (9, 'কলার প্লেটে সাত সুতা', 'collar', '{\"একছাটা\":1}', '0', NULL),
// (10, 'কলার প্লেট', 'collar', '{\"একছাটা\":1}', '1', NULL),
// (11, 'লুজ হাতা', 'sleeve', '{\"একছাটা\":1}', '1', NULL),
// (12, 'হাতার নিচ ৩ সুতা', 'sleeve', '{\"একছাটা\":1}', '0', NULL),
// (13, 'সাইড ১.৫ সুতা', 'sleeve', '{\"একছাটা\":1}', '0', NULL),
// (14, 'স্ট্যাট কাফ', 'cuff', '{\"একছাটা\":1}', '1', NULL),
// (15, 'রাউন্ড কাফ', 'cuff', '{\"একছাটা\":1}', '1', NULL),
// (16, 'ডাবল প্লেট', 'plate', '{\"একছাটা\":1}', '1', NULL),
// (17, 'ডাবল প্লেট উল্টা', 'plate', '{\"একছাটা\":1}', '0', NULL),
// (18, 'নরমাল প্লেট', 'plate', '{\"একছাটা\":1}', '1', NULL),
// (19, 'নক সহ', 'plate', '{\"একছাটা\":1}', '0', NULL),
// (20, 'চোক্কা প্লেট', 'plate', '{\"একছাটা\":1}', '1', NULL),
// (21, 'ডিজাইন বুতাম', 'plate', '{\"একছাটা\":1}', '0', NULL),
// (22, 'বুকে এক পকেট', 'pocket', '{\"একছাটা\":1}', '1', NULL),
// (23, 'বুকে ১ ১/২ পকেট', 'pocket', '{\"একছাটা\":1}', '0', NULL),
// (24, 'বুকে মেসওয়াক পকেট', 'pocket', '{\"একছাটা\":1}', '0', NULL),
// (25, 'ডান পাশে ১ পকেট', 'pocket', '{\"একছাটা\":1}', '0', NULL),
// (26, 'বাম পাশে ১ পকেট', 'pocket', '{\"একছাটা\":1}', '0', NULL),
// (27, '২ পাশে পকেট', 'pocket', '{\"একছাটা\":1}', '0', NULL),
// (28, '১টি মোবাইল পকেট', 'pocket', '{\"একছাটা\":1}', '1', NULL),
// (29, 'পকেটে চেইন হবে', 'pocket','{"একছাটা":1}', 1, NULL),
// (30, '১ পকেটে চেইন হবে', 'pocket','{"একছাটা":1}', 1, NULL),
// (31, '২টি মোবাইল পকেট', 'pocket','{"একছাটা":1}', 1, NULL),
// (32, 'পেছনে ১ পকেট', 'pocket','{"একছাটা":1}', 1, NULL),
// (33, 'পেছনে ২ পকেট', 'pocket','{"একছাটা":1}', 1, NULL),
// (34, 'পিছনে তিরা', 'back', '{\"একছাটা\":1}', '1', NULL),
// (35, 'কলার, প্লেট ও হাতায় পাইপিং', 'piping', '{\"একছাটা\":1}', '1', NULL),
// (36, 'কলার প্লাট ও হাতার পট্টি অন্য কাপর দিয়ে পাইপিং', 'piping', '{\"একছাটা\":1}', '0', NULL),
// (37, 'কলার প্লেটে অন্য কাপর দিয়ে, শুধু হাতায় পাইপিং', 'piping', '{\"একছাটা\":1}', '0', NULL),
// (38, 'কলারের ১ দিকে প্লাটের ৩ দিকে ও হাতার পাইপিং', 'piping', '{\"একছাটা\":1}', '0', NULL),
// (39, 'বুকে চেইন', 'zip', '{\"একছাটা\":1}', '1', NULL),
// (40, 'ডান পকেটে চেইন', 'zip', '{\"একছাটা\":1}', '1', NULL),
// (41, 'বাম পকেটে চেইন', 'zip', '{\"একছাটা\":1}', '1', NULL),
// (42, 'মোবাইল পকেটে চেইন', 'zip', '{\"একছাটা\":1}', '1', NULL),
// (43, 'হাতা নিচ ৩ সুতা', 'sewing', '{\"একছাটা\":1}', '0', NULL),
// (44, 'TR', 'embroidery', '{\"একছাটা\":1}', '0', NULL),
// (45, 'BD', 'embroidery', '{\"একছাটা\":1}', '0', NULL),
// (46, 'No.', 'embroidery', '{\"একছাটা\":1}', '1', NULL),
// (47, 'কারচুপির নাম', 'karchupi', '{\"একছাটা\":1}', '1', NULL),
// (48, 'রাবার, ফিতা, পকেট, চেইন', 'others','{"একছাটা":1}', 1, NULL),
// (49, 'রাবার', 'others','{"একছাটা":1}', 1, NULL),
// (50, 'ফিতা', 'others','{"একছাটা":1}', 1, NULL),
// (51, 'পকেট', 'others','{"একছাটা":1}', 1, NULL),
// (52, 'চেইন', 'others','{"একছাটা":1}', 1, NULL)